IPA_SI_VOWEL_KEYS = [
    "අ", "ආ", "ඇ", "ඈ", "ඉ", "ඊ", "උ", "ඌ", "ඒ", "එ", "ඔ", "ඕ"
]
IPA_SI_VOWEL_SUFFIX_MAP = {
    "අ": "", "ආ": "ා", "ඇ": "ැ", "ඈ": "ෑ", "ඉ": "ි", "ඊ": "ී",
    "උ": "ු", "ඌ": "ූ", "එ": "ෙ", "ඒ": "ේ", "ඔ": "ො", "ඕ": "ෝ"
}

IPA_SI_CONSONANT_KEYS = [
    "ච්", "ජ්", "ප්", "බ්", "ට්", "ඩ්", "ක්", "ග්", "ත්", "ද්", "ෆ්", "ව්", "ස්", "ශ්", "ෂ්",
    "ව්", "ල්", "ම්", "න්", "ර්", "ය්", "හ්"
]
IPA_SI_CONSONANT_MAP = {
    "ච්": "ච", "ජ්": "ජ", "ප්": "ප", "බ්": "බ", "ට්": "ට", "ඩ්": "ඩ", "ක්": "ක", "ග්": "ග",
    "ත්": "ත", "ද්": "ද", "ෆ්": "ෆ", "ව්": "ව", "ස්": "ස", "ශ්": "ශ", "ෂ්": "ෂ", "ල්": "ල",
    "ම්": "ම", "න්": "න", "ර්": "ර", "ය්": "ය", "හ්": "හ"
}

EXACT_MATCH_KEYS = [
    "sri", "lanka", "lankan", "and", "to", "are", "of", "an", "as", "or", "that"
]
EXACT_MATCH_MAP = {
    "sri": "ශ්‍රී", "lanka": "ලන්කා", "lankan": "ලන්කන්", "and": "ඇන්ඩ්", "to": "ටු", "are": "ආර්",
    "of": "ඔෆ්", "an": "ඇන්", "as": "ඈස්", "or": "ඕ", "that": "දැට්"
}
